https://medium.com/@anala007/the-power-of-pandas-mastering-the-groupby-method-477eb0a8915c

In [4]:
import pandas as pd
df = pd.DataFrame({"Name": ["Abe", "Brian", "Charles", "Abe", "Brian", "Charles"], 
                  "Age": [21, 22, 23, 24, 25, 26], 
                  "Income": [50000, 60000, 70000, 80000, 90000, 100000]}) 
print(df)

      Name  Age  Income
0      Abe   21   50000
1    Brian   22   60000
2  Charles   23   70000
3      Abe   24   80000
4    Brian   25   90000
5  Charles   26  100000

In [5]:
df.groupby("Name").mean()

          Age   Income
Name
Abe      22.5  65000.0
Brian    23.5  75000.0
Charles  24.5  85000.0

In [6]:
df.groupby("Name")['Income'].agg(['mean', 'median', 'std'])

            mean   median           std
Name
Abe      65000.0  65000.0  21213.203436
Brian    75000.0  75000.0  21213.203436
Charles  85000.0  85000.0  21213.203436

In [7]:
x=df.groupby("Name")
list(x)

[('Abe',
    Name  Age  Income
  0  Abe   21   50000
  3  Abe   24   80000),
 ('Brian',
      Name  Age  Income
  1  Brian   22   60000
  4  Brian   25   90000),
 ('Charles',
        Name  Age  Income
  2  Charles   23   70000
  5  Charles   26  100000)]